abdominal
aberrations
ability
ablation
abnormal
abnormalities
abnormality
abo
abortion
absence
absorption
abuse
acceleration
accompanying
according
accumulation
accuracy
acetate
acetic
acetyl
acetylation
acetylcholine
acetylcholinesterase
acetyltransferase
acid
acidic
acidosis
acids
acoustic
acquired
acquisition
acridine
acromegalic
acromegaly
across
acth
actin
acting
actinomyces
actinomycin
action
actions
activated
activation
activator
active
activities
activity
acute
acyl
adaptation
adapted
adaptive
addition
adenine
adenocarcinoma
adenoma
adenosine
adenosylmethionine
adenovirus
adenyl
adenylate
adherence
adhesion
adipocytes
adipose
adjuvant
administered
administration
adolescent
adolescents
adoptive
adrenal
adrenalectomy
adrenaline
adrenergic
adrenoceptor
adrenoceptors
adrenocortical
adsorption
adult
adulthood
adults
advanced
aerobacter
aerobic
aerogenes
aerosol
aerosols
aeruginosa
affect
affected
affecting
affective
afferent
afferents
affinity
aflatoxin
african
agar
agarose
age
aged
ageing
agent
agents
ages
agglutination
agglutinins
aggregates
aggregation
aging
agonist
agonists
aid
air
airborne
airway
airways
akr
ala
alanine
albicans
albino
albumin
alcohol
alcoholic
alcoholism
alcohols
aldehydes
aldolase
aldosterone
aldosteronism
algae
aliphatic
alkali
alkaline
alkyl
allergic
allergy
alloantigens
allogeneic
allogenic
allograft
allografts
allosteric
allotype
allotypic
alloxan
alpha
alteration
alterations
altered
alternative
altitude
alveolar
alveolitis
amber
american
amine
amines
amino
aminoacyl
aminobutyric
aminopyridine
aminotransferase
ammonia
ammonium
amniotic
among
amp
amphetamine
amphibian
ampicillin
amygdala
amygdaloid
amylase
amyloid
amyloidosis
anaemia
anaerobic
anaesthesia
anaesthetic
anaesthetized
analgesia
analgesic
analgesics
analogs
analogue
analogues
analyses
analysis
anaphylactic
anaphylatoxin
anaphylaxis
anastomosis
anatomical
anatomy
androgen
anemia
anesthesia
anesthetics
anesthetized
aneurysm
aneurysms
angina
angiographic
angiotensin
angle
anhydrase
animal
animals
anion
anions
anococcygeus
anomalies
anomalous
anorexia
anoxia
anoxic
antagonism
antagonist
antagonistic
antagonists
antenatal
anterior
anthracene
anti
antibacterial
antibiotic
antibiotics
antibodies
antibody
anticonvulsant
antidiuretic
antigen
antigenic
antigenicity
antigens
antihypertensive
antimicrobial
antisera
antiserum
antitrypsin
antitumor
antiviral
aorta
aortic
aplysia
apparatus
apparent
appearance
appetite
application
applications
applied
appraisal
approach
aqueous
arabinose
arbovirus
area
areas
arginine
aromatic
around
arrangement
arrest
arrhythmias
arterial
arteries
arteriosclerotic
artery
arthritis
articular
artificial
aryl
asbestos
ascaris
ascending
ascites
ascorbic
asparaginase
asparagine
aspartate
aspartic
aspects
aspergillus
asphyxia
aspiration
aspirin
assay
assays
assembly
assessing
assessment
assimilation
associated
association
associations
asthma
asymmetry
asymptomatic
atherosclerosis
atherosclerotic
atom
atp
atpase
atresia
atria
atrial
atrioventricular
atrium
atropine
attached
attachment
attack
attempt
attenuated
attenuation
attitudes
atypical
auditory
augmentation
aureus
author
autoantibodies
autoimmune
autologous
automated
automatic
automaticity
autonomic
autopsy
autoradiographic
autoradiography
autoregulation
auxotroph
auxotrophs
availability
avian
axon
axonal
axons
axoplasmic
azotobacter
baboon
baby
bacilli
bacillus
background
bacteremia
bacteria
bacterial
bactericidal
bacteriocin
bacteriological
bacteriophage
bacteriophages
bacterium
bacteroides
baker
balance
balb
band
barium
barley
barnacle
baroreceptor
baroreceptors
barr
barrier
basal
base
based
basement
bases
basic
basis
bcg
beads
bean
bearing
beating
bed
beef
behavior
behavioral
behaviour
behavioural
benefits
benign
benzo
benzodiazepines
beta
bicarbonate
bilateral
bilayer
bilayers
bile
biliary
bilirubin
binding
binocular
biochemical
biochemistry
biogenic
biologic
biological
biologically
biophysical
biopsy
biosynthesis
biosynthetic
biotin
biphasic
birth
bis
black
bladder
blast
block
blockade
blocker
blockers
blocking
blood
blowfly
blue
boar
bodies
body
bond
bonds
bone
border
borderline
bordetella
born
borne
botulinum
bound
bovine
bowel
bradykinin
brain
brains
brainstem
branch
branched
breakdown
breast
breathing
bretylium
brief
broiler
bromide
bronchial
bronchitis
bronchogenic
broth
brown
brucella
brush
bufo
bundle
burkitt
burned
burns
bypass
cadmium
caecum
caesium
caffeine
calcitonin
calcium
calculation
calculations
calf
california
called
calmette
calves
camp
canada
canal
cancer
cancers
candida
canine
capable
capacitance
capacity
capillaries
capillary
capsular
capsule
captopril
carbachol
carbohydrate
carbohydrates
carbon
carbonic
carboxyl
carboxylase
carboxylic
carcinogen
carcinogenesis
carcinogens
carcinoid
carcinoma
carcinomas
cardiac
cardiomyopathy
cardiopulmonary
cardiovascular
care
carlsbergensis
carnitine
carotid
carrier
carriers
carrying
cartilage
case
cases
cat
catabolic
catabolism
catabolite
catalase
catalysed
catalysis
catalytic
catalyzed
cataract
catechol
catecholamine
catecholamines
cathepsin
cation
cationic
cations
cats
cattle
caudate
causative
cause
caused
causes
cavity
cba
cell
cells
cellular
cellulase
cellulose
cent
center
centers
central
centrally
centrifugation
cephalosporins
cerebellar
cerebellum
cerebral
cerebrospinal
cerebrovascular
cereus
cerevisiae
certain
cervical
cervix
cesium
chain
chains
challenge
chambers
change
changes
changing
channel
channels
character
characteristic
characteristics
characterization
charge
charges
chemical
chemically
chemistry
chemoreceptor
chemotactic
chemotaxis
chemotherapy
chest
chick
chicken
chickens
chicks
child
childhood
children
chinese
chlamydia
chloramphenicol
chloride
chloro
chloroethyl
chlorophyll
chloroplasts
chloroquine
chlorpromazine
cholera
cholerae
cholesterol
choline
cholinergic
cholinesterase
chondroitin
choriomeningitis
chromaffin
chromatid
chromatin
chromatographic
chromatography
chromosomal
chromosome
chromosomes
chronic
chronically
chronotropic
chymotrypsin
cigarette
cilia
circadian
circuit
circular
circulating
circulation
circulatory
cirrhosis
cis
citrate
clamp
class
classes
classical
classification
clearance
clearing
cleavage
climbing
clinic
clinical
clinically
clinico
clinicopathologic
clip
clonal
clones
clonidine
close
clostridium
cluster
cns
coa
coagulation
coal
coarctation
coat
coated
cobra
cocaine
coccidioides
cochlear
coefficient
coefficients
coeliac
coenzyme
coeruleus
colchicine
cold
coli
colibacillosis
colicin
colicins
coliphage
colitis
collaborative
collagen
collagenase
collecting
colliculus
colon
colonic
colony
color
column
columns
coma
combination
combinations
combined
commercial
common
communication
community
comparative
compared
comparison
compartment
compartmentation
compartments
compensatory
competence
competition
competitive
complement
complementary
complementation
complete
complex
complexes
compliance
complicated
complicating
complications
component
components
composition
compound
compounds
compression
computer
concanavalin
concentration
concentrations
concept
concepts
concerned
concomitant
conditional
conditioned
conditioning
conditions
conductance
conductances
conduction
cone
conformation
conformational
congenital
conjugates
conjugation
connections
connective
conscious
consequences
considerations
constant
constants
constituents
constitutive
constriction
consumption
contact
contacts
containing
contamination
content
contents
continuous
contraceptive
contraceptives
contractile
contractility
contraction
contractions
contracture
contractures
contrast
contribution
contributions
control
controlled
controlling
controls
conventional
conversion
converting
cooling
cooperative
cooperativity
copper
cord
core
corn
cornea
corneal
corneum
coronary
corpus
correction
correlated
correlates
correlation
correlations
corresponding
cortex
cortical
corticosteroid
corticosteroids
corticosterone
corticotrophin
cortisol
cortisone
corynebacterium
counseling
count
counting
coupled
coupling
course
covalent
cow
cows
coxsackie
crab
cranial
crassa
crayfish
creatine
criteria
criterion
critical
crohn
cross
crude
crystal
crystalline
csf
cultivated
cultivation
cultural
culture
cultured
cultures
current
currents
curve
curves
cutaneous
cyanide
cyclase
cycle
cyclic
cyclophosphamide
cyproheptadine
cyst
cysteine
cystic
cytochalasin
cytochemical
cytochemistry
cytochrome
cytochromes
cytological
cytolysis
cytolytic
cytomegalovirus
cytoplasm
cytoplasmic
cytosine
cytosol
cytotoxic
cytotoxicity
daily
damage
damaged
dark
data
day
ddt
deaminase
death
deaths
decarboxylase
decay
decerebrate
decision
decline
decomposition
decrease
decreased
decrement
deep
defect
defective
defects
defense
deferens
deficiency
deficient
deficit
defined
degeneration
degradation
degrading
degree
degrees
dehydratase
dehydration
dehydrogenase
dehydrogenases
delay
delayed
deletion
delivery
delta
demonstrated
demonstration
denaturation
denatured
dendritic
denervated
denervation
density
dental
deoxy
deoxyribonucleic
dependence
dependency
dependent
depleted
depletion
depolarization
depolarized
deposition
deposits
depressed
depression
deprivation
deprived
derivation
derivative
derivatives
derived
dermal
dermatitis
dermis
descending
description
desensitization
destruction
detect
detected
detecting
detection
detergent
determinant
determinants
determination
determinations
determine
determined
determining
developing
development
developmental
device
dexamethasone
dextran
diabetes
diabetic
diabetics
diagnosis
diagnostic
dialysis
diaphragm
diarrhea
diazepam
dibutyryl
dichroism
diet
dietary
diethylamide
diets
difference
differences
different
differential
differentiated
differentiation
differing
diffraction
diffuse
diffusing
diffusion
digestibility
digestion
digestive
digoxin
dihydro
dihydrotestosterone
dihydroxy
dilution
dimensional
dimensions
dimer
dimers
dimethyl
dimethylbenz
dinitrophenyl
dinucleotide
dioxide
diphenylhydantoin
diphosphatase
diphosphate
diphtheria
diploid
direct
directed
directly
disappearance
discharge
discharges
discrete
discrimination
discussion
disease
diseases
disinfection
disorder
disorders
dispersion
disposition
disruption
disseminated
dissimilation
dissociated
dissociation
distal
distance
distinct
distinctive
distress
distribution
distributions
disturbances
disulfide
disulphide
diuresis
diuretic
diuretics
diurnal
divalent
diversity
division
dna
dodecyl
dog
dogs
domestic
domesticus
dominance
dominant
donor
donors
dopa
dopamine
dopaminergic
dorsal
dosage
dose
doses
double
drainage
dried
drinking
drosophila
drug
drugs
dry
drying
dual
duct
due
duodenal
duodenum
duration
dust
dynamic
dynamics
dysentery
dysfunction
dysplasia
dystrophy
ear
early
east
ectopic
ectromelia
edema
eeg
eel
effect
effective
effectiveness
effector
effects
efferent
efficacy
efficiency
efflux
egg
eggs
ehrlich
eight
elaboration
elastase
elastic
elastin
elderly
electric
electrical
electrocardiogram
electrocardiographic
electrode
electrolyte
electrolytes
electromagnetic
electron
electronic
electrophoresis
electrophoretic
electrophysiologic
electrophysiological
electrophysiology
elevated
elevation
elicited
elimination
elongation
embolism
embryo
embryonic
embryos
emotional
emphysema
encephalitis
encephalomyelitis
end
endings
endocardial
endocarditis
endocrine
endogenous
endometrial
endonuclease
endoplasmic
endothelial
endothelium
endotoxin
energetics
energy
england
enhanced
enhancement
enhancing
enriched
enteric
enteritidis
enterobacteriaceae
enterochelin
enteropathogenic
enterotoxin
enteroviruses
entry
envelope
envelopes
environment
environmental
environments
enzootic
enzymatic
enzyme
enzymes
enzymic
eosinophilia
eosinophilic
epidemic
epidemiologic
epidemiological
epidemiology
epidermal
epidermis
epididymal
epilepsy
epileptic
epinephrine
epithelial
epithelium
epstein
equation
equations
equilibrium
equine
equivalent
error
errors
erwinia
erythema
erythematosus
erythrocyte
erythrocytes
erythroid
erythropoiesis
erythropoietic
erythropoietin
escherichia
esophageal
esophagus
essential
established
establishment
ester
esterase
esterases
esters
estimates
estimating
estimation
estradiol
estrogen
estrogens
etching
ethanol
ethyl
ethylene
etiology
evaluating
evaluation
even
events
evidence
evoked
evolution
exaggerated
examination
excess
exchange
exchangeable
exchanges
excision
excitability
excitation
excitatory
exclusion
excretion
exercise
existence
exocrine
exogenous
exonuclease
expansion
experience
experiences
experimental
experimentally
experiments
expiratory
explants
exponential
exposed
exposure
expression
extension
extent
external
extracellular
extracorporeal
extract
extracted
extraction
extracts
exudate
exudative
eye
fabry
facial
facilitated
facilitation
factor
factors
faecalis
failure
familial
families
family
fast
fasting
fat
fatal
fate
fatigue
fattening
fatty
features
febrile
fecal
feces
fed
feed
feedback
feeding
feline
female
females
femoral
fermentation
ferritin
fertility
fetal
fetoprotein
fetus
fever
fiber
fibers
fibre
fibres
fibril
fibrillation
fibrils
fibrin
fibrinogen
fibrinolytic
fibroblast
fibroblasts
fibrosis
field
fields
filaments
filtration
findings
fine
firing
first
fish
five
fixation
fixed
flagellar
flavobacterium
flight
flora
flow
fluctuations
fluid
fluids
fluorescence
fluorescens
fluorescent
fluoro
flux
fluxes
fly
focus
foetal
folate
follicles
follow
followed
following
food
foods
foot
force
forces
forearm
forelimb
form
formaldehyde
formation
formed
forming
forms
found
four
fourier
fourth
fowl
fraction
fractional
fractionated
fractionation
fractions
fragment
fragments
free
freeze
freezing
frequency
fresh
friend
frog
frogs
frontal
frozen
fructose
frusemide
fsh
fucose
function
functional
functions
fungal
fungi
fungus
furosemide
fusarium
fusion
gaba
galactokinase
galactose
galactosidase
gallbladder
gamma
ganglia
ganglion
ganglionic
gap
gas
gases
gastric
gastrin
gastrocnemius
gastroenteritis
gastrointestinal
gating
gel
gelatin
gene
general
generalized
generated
generation
genes
genesis
genetic
genetically
genetics
geniculate
genital
genome
genotype
genus
geometry
germfree
germination
gestation
gestational
ghosts
giant
gills
girl
given
gland
glands
glass
glial
globin
globulin
glomerular
glomeruli
glomerulonephritis
glomerulosa
glucagon
glucan
glucocorticoid
glucocorticoids
gluconate
gluconeogenesis
glucose
glucosidase
glucuronidase
glucuronide
glutamate
glutamic
glutamine
glutamyl
glutathione
glyceraldehyde
glycerol
glycerophosphate
glycine
glycogen
glycolipid
glycolysis
glycolytic
glycoprotein
glycoproteins
glycosaminoglycans
glycosphingolipids
glycyl
glyoxylate
gmp
gnotobiotic
goat
goats
goldblatt
goldfish
golgi
gonadal
gout
graded
gradient
gradients
graft
grafts
gram
granular
granule
granules
granulocyte
granuloma
granulomatous
gravis
green
gross
group
groups
growing
grown
growth
guanethidine
guanine
guanosine
guide
guinea
gut
gyrus
haem
haemodialysis
haemodynamics
haemoglobin
haemolytic
haemophilus
haemorrhage
hair
half
halogenated
halophilic
halothane
hamster
hamsters
hand
handling
hansenula
hapten
haptoglobin
hawaii
hazard
hazards
head
healing
health
healthy
heart
hearts
heat
heating
heavy
height
hela
helical
helix
helper
hemagglutination
hemagglutinin
hematopoietic
heme
hemodialysis
hemodynamic
hemodynamics
hemoglobin
hemolysin
hemolysis
hemolytic
hemopoietic
hemorrhage
hemorrhagic
hen
heparin
hepatic
hepatitis
hepatocytes
hepatoma
hereditary
herpes
herpesvirus
heterogeneity
heterogeneous
heterologous
heterotrophic
hexokinase
hexose
high
higher
highly
hind
hip
hippocampal
hippocampus
histamine
histidine
histochemical
histochemistry
histocompatibility
histologic
histological
histology
histone
histones
histopathologic
histopathological
histopathology
history
hla
hodgkin
hog
homeostasis
homogenates
homogeneous
homograft
homografts
homologous
homozygous
horizontal
hormonal
hormone
hormones
horn
horse
horseradish
hospital
host
hosts
hour
house
human
humans
humidity
humoral
hurler
hyaluronic
hyaluronidase
hybrid
hybridization
hybrids
hydrocarbon
hydrocarbons
hydrochloride
hydrocortisone
hydrogen
hydrolase
hydrolases
hydrolysis
hydrophobic
hydrostatic
hydroxy
hydroxybutyrate
hydroxydopamine
hydroxylase
hydroxylation
hydroxytryptamine
hyperglycemia
hyperlipoproteinemia
hyperplasia
hyperpolarization
hypersensitivity
hypertension
hypertensive
hyperthermia
hypertonic
hypertrophic
hypertrophied
hypertrophy
hypogastric
hypoglycaemia
hypoglycemia
hypophysectomy
hypotension
hypotensive
hypothalamic
hypothalamus
hypothermia
hypothermic
hypothesis
hypothyroidism
hypoxia
hypoxic
identical
identification
identified
identity
idiopathic
iga
igd
ige
igg
igm
iii
ileal
ileum
illness
illumination
ilv
image
imipramine
immature
immediate
immitis
immune
immunity
immunization
immunized
immunoassay
immunochemical
immunochemistry
immunodiffusion
immunofluorescence
immunofluorescent
immunogenicity
immunoglobulin
immunoglobulins
immunologic
immunological
immunologically
immunology
immunoreactive
immunosuppression
immunosuppressive
immunotherapy
impact
impaired
impairment
impedance
implications
importance
important
improved
impulse
impulses
inactivated
inactivation
inactive
inbred
incidence
including
inclusion
incomplete
incorporated
incorporation
increase
increased
increases
increasing
incubated
incubation
independence
independent
index
indication
indications
indicator
indicators
indices
indirect
individual
individuals
indomethacin
induced
inducer
inducers
inducible
inducing
induction
infancy
infant
infantile
infants
infarct
infarction
infected
infection
infections
infectious
infectivity
inferior
inflammation
inflammatory
inflation
influence
influenced
influences
influencing
influenza
influx
information
infusion
infusions
ingestion
inhalation
inhaled
inheritance
inherited
inhibit
inhibited
inhibiting
inhibition
inhibitor
inhibitors
inhibitory
initial
initiated
initiation
injected
injection
injections
injured
injuries
injury
inner
innervated
innervation
inoculated
inoculation
inorganic
inositol
inotropic
input
inputs
insect
insecticidal
insoluble
insufficiency
insulin
intact
intake
integrated
integration
intensity
intensive
interaction
interactions
intercellular
interconversion
interference
interferon
intermediate
intermediates
intermittent
internal
internally
interphase
interpretation
interrelations
interrelationship
interrelationships
interstitial
interval
intervals
intestinal
intestine
intoxication
intra
intracellular
intracerebral
intracranial
intramyocardial
intrarenal
intrauterine
intravascular
intravenous
intravenously
intraventricular
intrinsic
introduction
invasion
investigation
investigations
involved
involvement
involving
inward
iodide
iodine
ion
ionic
ionophore
ions
iris
iron
irradiated
irradiation
irreversible
ischaemia
ischaemic
ischemia
ischemic
islet
islets
iso
isocitrate
isoenzyme
isoenzymes
isolated
isolates
isolation
isoleucine
isomerase
isomers
isometric
isoprenaline
isoproterenol
isotonic
isotope
isozymes
issues
japan
japanese
jejunum
joint
juice
junction
junctional
junctions
juvenile
kallikrein
kanamycin
keto
ketoacidosis
ketone
kidney
kidneys
killed
killing
kinase
kinases
kinetic
kinetics
kinin
kitten
kittens
klebsiella
knee
known
label
labeled
labeling
labelled
labelling
labile
laboratory
lac
lack
lacking
lactate
lactating
lactation
lactic
lactobacillus
lactogen
lactose
laidlawii
lamb
lambda
lambs
langerhans
lanthanum
large
larvae
laryngeal
laser
late
latent
later
lateral
latex
lattice
law
layer
layers
lead
leaf
lean
learning
lecithin
leech
left
leg
length
lens
leprae
leprosy
lesion
lesions
less
lethal
leucine
leucocyte
leucocytes
leuconostoc
leucyl
leukaemia
leukaemic
leukemia
leukemias
leukemic
leukocyte
leukocytes
level
levels
levodopa
licheniformis
life
ligand
ligands
ligase
ligated
ligation
light
like
limb
limitation
limitations
limited
limiting
limits
limulus
line
linear
lines
linkage
linked
linking
linoleic
lipase
lipid
lipids
lipogenesis
lipolysis
lipolytic
lipopolysaccharide
lipopolysaccharides
lipoprotein
lipoproteins
liposomes
liquid
listeria
literature
lithium
live
liver
livers
living
load
loaded
loading
lobe
lobster
local
localization
localized
location
loci
locomotion
locus
lon
long
longitudinal
loss
losses
low
lower
lumbar
lung
lungs
lupus
luteinizing
lyase
lymph
lymphatic
lymphoblastic
lymphoblastoid
lymphocyte
lymphocytes
lymphocytic
lymphoid
lympholysis
lymphoma
lymphomas
lymphoproliferative
lymphosarcoma
lysergic
lysine
lysis
lysolecithin
lysosomal
lysosomes
lysozyme
lytic
macaca
macromolecular
macromolecules
macrophage
macrophages
magnesium
magnetic
maintained
maintenance
major
malaria
malate
male
males
malic
malignancy
malignant
malnutrition
maltose
mammalian
mammals
mammary
mammography
man
management
manganese
manifestation
manifestations
mannitol
mannose
mansoni
map
mapping
marcescens
marek
marine
marinus
marked
marker
markers
marrow
masking
mass
massive
mast
material
materials
maternal
mathematical
matrix
matter
maturation
mature
maturity
maximal
maximum
may
meal
mean
means
measles
measure
measured
measurement
measurements
measuring
meat
meats
mechanical
mechanics
mechanism
mechanisms
mechanoreceptors
media
medial
mediated
mediating
mediation
mediator
medical
medication
medium
medroxyprogesterone
medulla
medullary
megaterium
melanin
melanocyte
melanogaster
melanoma
melatonin
mellitus
members
membrane
membranes
memory
men
meningitidis
meningitis
meningococcal
menopause
mental
mercury
mesenteric
messenger
metabolic
metabolism
metabolite
metabolites
metabolizing
metal
metaphase
metastases
methane
methanol
methionine
method
methodological
methods
methoxy
methoxypsoralen
methyl
methylation
methylprednisolone
methyltransferase
mice
michaelis
micro
microbial
microbiological
micrococcus
microfilaments
microglobulin
microorganisms
micropuncture
microscope
microscopic
microscopical
microscopy
microsomal
microsomes
microtubule
midbrain
middle
migration
mild
milk
mineral
miniature
minicells
mink
minor
mitochondria
mitochondrial
mitogen
mitogenic
mitogens
mitomycin
mitosis
mitotic
mitral
mixed
mixture
mixtures
mobility
mobilization
mode
model
models
moderate
modification
modifications
modified
modulation
molecular
molecule
molecules
moloney
monitoring
monkey
monkeys
mono
monoamine
monoamines
monocytes
monocytogenes
monolayer
monolayers
mononuclear
mononucleosis
monophosphate
monosaccharides
monosynaptic
monoxide
months
morbidity
morphine
morphogenesis
morphologic
morphological
morphology
morphometric
morphometry
mortality
mosaic
mosquitos
mother
mothers
motility
motion
motoneurones
motoneurons
motor
mouse
mouth
movement
movements
moving
mucopeptide
mucopolysaccharide
mucopolysaccharides
mucor
mucosa
mucosal
multiple
multiplication
murine
muscarinic
muscle
muscles
muscular
mutagenesis
mutagenic
mutagenicity
mutans
mutant
mutants
mutation
mutations
mutator
myasthenia
mycelial
mycobacterium
mycoplasma
mycoplasmas
myelin
myelinated
myeloma
myocardial
myocarditis
myocardium
myoglobin
myometrium
myosin
myxicola
myxococcus
nad
nalidixic
nasal
national
native
natriuresis
natural
naturally
nature
near
neck
necropsy
necrosis
necrotizing
negative
neisseria
neomycin
neonatal
neonatally
neoplasia
neoplasms
neoplastic
nephron
nephrotic
nerve
nerves
nervous
net
neural
neuraminidase
neuroblastoma
neurochemical
neuromuscular
neuron
neuronal
neurone
neurones
neurons
neuropathy
neurophysin
neurospora
neurotransmitters
neutral
neutralization
neutralizing
neutrophils
new
newborn
newcastle
newly
nicotinamide
nicotine
nicotinic
nidulans
niger
nitrate
nitrite
nitro
nitrogen
nitrosoguanidine
nitrosourea
nmr
nocturnal
node
nodes
nodular
noise
non
nonlinear
nonsense
nonspecific
noradrenaline
noradrenergic
norepinephrine
normal
normotensive
north
note
novel
novo
nuclear
nuclease
nucleated
nuclei
nucleic
nucleoside
nucleotide
nucleotides
nucleus
nude
null
number
numbers
numerical
nutrition
nutritional
nzb
obese
obesity
observation
observations
observed
obstetric
obstruction
obstructive
obtained
occlusion
occlusive
occupational
occurrence
occurring
ocular
oculomotor
oedema
oestradiol
oestrogen
offspring
oil
old
older
olfactory
oligonucleotides
oligosaccharides
olive
olivocerebellar
onchocerca
one
onset
ontario
ontogenesis
ontogeny
oocyte
open
operation
operations
operative
operator
operon
opiate
optic
optical
optimal
optimum
oral
orally
orange
order
organ
organic
organism
organisms
organization
organs
orientation
origin
ornithine
ortho
oscillation
oscillations
osmium
osmotic
ouabain
outcome
outer
outflow
output
outward
ovarian
ovary
oviduct
ovine
oxidase
oxidation
oxidative
oxide
oxidized
oxo
oxoglutarate
oxygen
oxygenase
oxygenation
oxytocin
ozone
pacemaker
pacing
paget
pain
pair
palsy
pancreas
pancreatic
pancreatitis
papain
papaverine
paper
papillary
papio
paradoxical
parainfluenza
parallel
paralysis
paramecium
parameter
parameters
parasite
parathyroid
parenchymal
parental
parietal
parkinson
parotid
paroxysmal
part
partial
partially
participation
particle
particles
particular
particulate
passage
passive
pasteurella
patch
pathogenesis
pathogenic
pathogenicity
pathologic
pathological
pathology
pathway
pathways
patient
patients
pattern
patterns
pectoris
pediatric
pelvic
penetration
penicillamine
penicillin
penicillinase
penicillium
pentose
people
pepsin
peptic
peptide
peptides
per
perception
perceptual
performance
perfringens
perfused
perfusion
perinatal
period
periods
peripheral
peritoneal
permanent
permeability
permeation
peroxidase
peroxidation
peroxide
peroxisomes
persistence
persistent
persons
pertussis
pestis
pgo
pha
phage
phagocytic
phagocytosis
pharmacokinetics
pharmacologic
pharmacological
pharmacology
phase
phases
phasic
phe
phenethyl
phenol
phenomena
phenomenon
phenotype
phenotypic
phenoxybenzamine
phentolamine
phenyl
phenylalanine
phenylalanyl
phi
phosphatase
phosphatases
phosphate
phosphates
phosphatidyl
phosphatidylcholine
phosphatidylinositol
phosphodiesterase
phosphoenolpyruvate
phosphofructokinase
phosphohydrolase
phosphokinase
phospholipase
phospholipid
phospholipids
phosphoribosyl
phosphoribosyltransferase
phosphorus
phosphorylase
phosphorylation
phosphotransferase
photodynamic
photoreceptor
physical
physician
physico
physicochemical
physiologic
physiological
physiology
phytohaemagglutinin
phytohemagglutinin
picture
pig
pigeon
piglets
pigment
pigmentation
pigmentosum
pigments
pigs
pilot
pineal
pipiens
pithed
pituitary
placenta
placental
planar
plant
plants
plaque
plasma
plasmid
plasmids
plasminogen
plasmodium
plastic
plate
platelet
platelets
platinum
pleiotropic
pleural
plus
pneumococcal
pneumococcus
pneumonia
pneumoniae
pneumonitis
point
poisoning
pola
polarity
polarized
poliovirus
poly
polyacrylamide
polyamine
polymer
polymerase
polymerases
polymorphism
polymorphonuclear
polynucleotide
polynucleotides
polyoma
polypeptide
polypeptides
polyribosomes
polysaccharide
polysaccharides
pontine
ponto
pool
pools
population
populations
porcine
pork
porphyria
portal
position
positive
possibilities
possible
post
posterior
postmortem
postnatal
postoperative
postsynaptic
potassium
potency
potent
potential
potentials
potentiation
poultry
power
practical
practice
pre
precursor
precursors
prediction
predictive
preferential
pregnancies
pregnancy
pregnant
preliminary
premature
prenatal
preoperative
preparation
preparations
prepared
prepubertal
presence
present
presentation
preservation
pressor
pressure
pressures
presynaptic
pretreated
pretreatment
prevalence
preventing
prevention
preventive
previous
previously
primary
primate
primates
primed
primitive
principle
principles
pro
probe
probes
problem
problems
procaine
procedure
procedures
process
processes
processing
produce
produced
producing
product
production
products
profile
profiles
progeny
progesterone
prognosis
prognostic
program
progression
progressive
proinsulin
projection
projections
prolactin
proliferation
proliferative
proline
prolonged
prolyl
promoter
promoting
prone
propagation
properties
prophage
prophylactic
prophylaxis
propionate
propranolol
prospective
prostaglandin
prostaglandins
prostate
prostatic
prosthesis
protease
proteases
protection
protective
protein
proteinase
proteins
proteoglycans
proteolysis
proteolytic
proteus
proton
protons
protoplasts
proximal
pseudomonad
pseudomonas
psoriasis
psychiatric
psychological
psychosocial
psychrophilic
pulmonary
pulse
pump
pure
purification
purified
purine
purkinje
puromycin
purpura
putrescine
pyramidal
pyrene
pyridine
pyridoxal
pyridoxine
pyrimidine
pyrophosphatase
pyrophosphate
pyruvate
qualitative
quality
quantal
quantitation
quantitative
quaternary
quinidine
rabbit
rabbits
rabies
radiation
radical
radioactive
radioactivity
radioautographic
radioautography
radioimmunoassay
radiologic
radiological
radiosensitivity
radiotherapy
raised
ram
rana
random
range
ranvier
raphe
rapid
rat
rate
rates
ratio
ratios
rats
rauscher
ray
rays
reabsorption
reacting
reaction
reactions
reactivation
reactive
reactivity
reagent
reagents
reappraisal
rec
reca
recall
receiving
recent
receptive
receptor
receptors
recipient
recipients
reciprocal
recognition
recombination
reconstitution
reconstruction
recorded
recording
recovery
rectal
rectification
rectum
recurrence
recurrent
red
redox
reduced
reducing
reductase
reduction
reference
reflex
reflexes
regenerating
regeneration
region
regional
regions
regression
regular
regulating
regulation
regulatory
rejection
related
relating
relation
relations
relationship
relationships
relative
relaxation
relay
release
released
releasing
relevance
removal
renal
renin
renovascular
repair
repeated
repetitive
replacement
replication
replicative
report
reported
reports
representation
repression
reproduction
reproductive
required
requirement
requirements
requiring
research
resection
resembling
reserpine
reserve
residual
residue
residues
resin
resistance
resistant
resolution
resonance
respect
respiration
respiratory
responder
responding
response
responses
responsible
responsive
responsiveness
rest
resting
restoration
restricted
restriction
resulting
results
resuscitation
retardation
retention
reticular
reticulocyte
reticulum
retina
retinal
retinopathy
retrograde
revascularization
revealed
reversal
reversible
reversion
review
rhesus
rheumatic
rheumatoid
rhodopseudomonas
rhythm
rhythms
riboflavin
ribonuclease
ribonucleases
ribonucleic
ribosomal
ribosome
ribosomes
rich
rifampin
right
rin
ring
risk
risks
rna
rod
rodents
rods
role
roles
root
roots
rosette
rough
rous
route
routes
routine
rubella
rubidium
rumen
rupture
saccharomyces
safety
salicylate
saline
salivary
salmonella
salmonellae
salmonellosis
salt
salts
sample
samples
sampling
sar
saralasin
sarcoidosis
sarcoma
sarcoplasmic
sartorius
scale
scanning
scattering
schistosoma
schizophrenia
schizophrenic
school
sciatic
scleroderma
sclerosis
scoliosis
screening
sea
search
seasonal
second
secondary
secretion
secretions
secretory
section
sections
sedimentation
segment
segmental
segments
seizures
selected
selection
selective
selenium
self
semen
seminal
sendai
senescence
sensitive
sensitivity
sensitization
sensitized
sensory
separated
separation
sephadex
septal
septum
sequence
sequences
sequential
sera
serial
series
serine
serologic
serological
serotonin
serratia
serum
seven
several
severe
sex
sexual
shape
shear
sheep
shift
shigella
shock
short
shunts
sialic
siamese
siblings
sickle
sickness
side
signal
signals
significance
significant
signs
silver
simian
similarities
simple
simplex
simplified
simulated
simulating
simulation
simultaneous
single
sinus
sister
site
sites
situ
six
size
sizes
skeletal
skin
sleep
slices
slime
slow
slowly
small
smoke
smoking
smooth
social
sodium
soft
soil
soleus
solid
solitary
solubility
solubilization
solubilized
soluble
solute
solution
solutions
somatic
somatomedin
somatosensory
somatostatin
source
sources
south
sow
sows
space
span
sparing
spatial
special
specialized
species
specific
specifically
specificities
specificity
specimens
spectra
spectral
spectrophotometric
spectroscopic
spectroscopy
spectrum
speed
sperm
spherical
spherocytosis
spheroplasts
sphincter
sphingomyelin
spike
spin
spinal
spindle
spindles
spironolactone
splanchnic
spleen
spleens
splenectomy
splenic
splitting
spontaneous
spontaneously
spores
sporulation
spread
squamous
squid
stability
stabilization
stable
stage
stages
stained
staining
standard
standardization
staphylococcal
staphylococci
staphylococcus
starch
starvation
starved
state
states
stationary
statistical
status
steady
stearothermophilus
stem
stenosis
step
sterilization
steroid
steroids
sterol
sterols
stimulants
stimulated
stimulates
stimulating
stimulation
stimulatory
stimuli
stimulus
stomach
stomatitis
storage
stored
strain
strains
strand
stranded
stratum
strength
streptococcal
streptococci
streptococcus
streptomyces
streptomycin
streptozotocin
stress
stretch
striate
striated
striatum
stringent
strip
strips
stroke
strontium
structural
structure
structures
studied
studies
study
studying
sub
subacute
subcellular
subclasses
subcutaneous
subjected
subjects
submaxillary
submitochondrial
subpopulations
subsequent
substance
substances
substituted
substitution
substrate
substrates
subtilis
subunit
subunits
succinate
sucrose
sudden
suffering
sugar
sugars
suicidal
suicide
sulfate
sulfhydryl
sulfur
sulphate
superficial
superior
supernatant
superoxide
supersensitivity
supplementation
supply
support
suppression
suppressive
suppressor
suprasylvian
surface
surfaces
surfactant
surgery
surgical
surrounding
surveillance
survey
survival
surviving
susceptibility
susceptible
suspension
suspensions
sustained
sweat
swelling
swine
swiss
sympathetic
sympathomimetic
symptoms
synapse
synapses
synaptic
synaptosomes
synchronization
synchronized
syndrome
synergistic
synergy
syngeneic
synovial
synthase
synthesis
synthesized
synthesizing
synthetase
synthetases
synthetic
syphilis
syrian
system
systemic
systems
systolic
tablets
taenia
tail
target
task
taste
taxonomy
technical
technique
techniques
teichoic
temperature
temperatures
template
temporal
tendon
tension
term
terminal
terminals
termination
terms
test
testicular
testing
testis
testosterone
tests
tetanic
tetanus
tetracycline
tetraethylammonium
tetrahydrocannabinol
tetrahymena
tetrodotoxin
tge
thalamic
thalamus
thalassaemia
theophylline
theoretical
theory
therapeutic
therapy
thermal
thermodynamic
thermophilic
thermoregulation
thermoregulatory
thermosensitive
thiamine
thick
thickness
thin
thiobacillus
thiol
third
thoracic
threatened
three
threonine
threshold
thrombin
thrombocytopenic
thromboembolism
thrombosis
thymectomized
thymectomy
thymic
thymidine
thymine
thymineless
thymocytes
thymus
thyrocalcitonin
thyroglobulin
thyroid
thyroiditis
thyrotoxicosis
thyrotropin
thyroxine
tick
time
times
timing
tissue
tissues
titration
toad
tobacco
tolbutamide
tolerance
tolerant
toluene
tone
tonic
tooth
topical
topography
total
toward
towards
toxic
toxicity
toxin
toxins
tracer
trachea
tracheal
tract
training
trans
transaminase
transcription
transcutaneous
transducing
transfer
transferase
transformation
transformed
transfusion
transhydrogenase
transient
transition
transl
translation
translational
translocation
translocations
transmembrane
transmissible
transmission
transmitter
transplant
transplantation
transplanted
transport
transverse
trauma
traumatic
treated
treatment
trehalose
trends
trh
tri
trial
trials
tricarboxylic
trigeminal
triglyceride
triglycerides
triiodothyronine
triphosphatase
triphosphate
trisomy
tritiated
trna
troponin
trout
true
trypanosoma
trypsin
tryptophan
tryptophanase
tsh
tube
tuberculin
tuberculosis
tubocurarine
tubular
tubule
tubules
tumor
tumors
tumour
tumours
turkey
turkeys
turnover
turtle
twenty
twin
twins
twitch
two
type
types
typhimurium
typing
tyramine
tyrosine
tyrosyl
ubiquinone
ulcer
ulceration
ulcerative
ultrafiltration
ultrasonic
ultrasound
ultrastructural
ultrastructure
ultraviolet
unable
unanaesthetized
unanesthetized
undergoing
unexpected
unilateral
unit
united
units
unresponsiveness
unstable
untreated
unusual
upon
upper
uptake
uracil
urate
urban
urchin
urea
uremic
ureter
uric
uridine
urinary
urine
use
used
usefulness
users
using
uterine
utero
uterus
utilization
utilizing
vaccinated
vaccination
vaccine
vaccines
vaccinia
vagal
vaginal
vagotomy
vagus
validation
validity
valine
valinomycin
value
values
valve
valvular
var
variability
variable
variables
variant
variants
variation
variations
varicella
various
varying
vas
vascular
vasoactive
vasoconstriction
vasoconstrictor
vasodilator
vasomotor
vasopressin
vegetative
vein
veins
velocity
vena
venezuelan
venom
venous
ventilation
ventilatory
ventral
ventricle
ventricles
ventricular
verapamil
versus
vertebrate
vertebrates
vesicle
vesicles
vesicular
vessel
vessels
vestibular
via
viability
vibration
vibrio
view
vii
viii
vinblastine
vinyl
viral
virions
virulence
virulent
virus
viruses
visceral
viscosity
vision
visual
visually
vitamin
vitro
vivo
voltage
volume
volumes
vulgaris
wales
wall
walls
warfarin
washed
water
wave
waves
weak
weeks
weight
weights
well
west
western
whale
wheat
white
whole
wild
withdrawal
within
without
women
work
workers
working
world
wound
wounds
xanthus
xenopus
xeroderma
xylose
year
years
yeast
yeasts
yersinia
yield
yields
young
zealand
zinc
zona
zonal
zone
